<?php
namespace Database\Seeders;

use App\Timeline;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TimelineSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        {
            DB::table('users')->insert([
                'id'         => 1,
                'user_id'    => 1,
                'timeline'   => {
                    "月曜日":{"時間1":"朝会","時間2":"書類整理","時間3":"作業時間","時間4":"昼休憩","時間5":"作業時間","時間6":"定例会議","時間7":"夕会"},
                    "火曜日":{"時間1":"朝会","時間2":"事務処理","時間3":"作業時間","時間4":"昼休憩","時間5":"作業時間","時間6":"定例会議","時間7":"夕会"},
                    "水曜日":{"時間1":"朝会","時間2":"外部会議","時間3":"作業時間","時間4":"昼休憩","時間5":"作業時間","時間6":"定例会議","時間7":"夕会"},
                    "木曜日":{"時間1":"朝会","時間2":"作業時間","時間3":"作業時間","時間4":"昼休憩","時間5":"作業時間","時間6":"定例会議","時間7":"夕会"},
                    "金曜日":{"時間1":"朝会","時間2":"事務処理","時間3":"作業時間","時間4":"昼休憩","時間5":"作業時間","時間6":"定例会議","時間7":"夕会"},
                },
                'deleted_at' => 0,
            ]);
        }
    }
}
